/*
Задание 1

Написать программу, которая:
    - принимает на вход два целых числа (a и b, a < b)
    - выводит все чётные числа в промежутке от a до b.
*/

#include <iostream>
using namespace std;

int main()
{
    int a = 0, b = 0;
    cin >> a >> b;
    if (a > b)
    {
        int temp = a;
        a = b;
        b = temp;
    }
    for (size_t i = a; i < b; i++)
        if (i % 2 == 0)
            cout << i << endl;
}
#include <iostream>: Эта строка подключает стандартную библиотеку ввода-вывода C++, которая содержит функции и классы для работы с вводом и выводом данных
using namespace std;: Эта строка позволяет использовать пространство имен std, которое содержит все классы, функции и переменные, определённые в библиотеке iostream
int main(): Это основная функция, которая выполняется при запуске программы.
int a = 0, b = 0;: Здесь объявляются две целочисленные переменные a и b, и инициализируются нулями.
cin >> a >> b;: Эта строка считывает два числа с клавиатуры и сохраняет их в переменных a и b
if (a > b): Это условное выражение проверяет, больше ли значение a значения b.
int temp = a;: Эта строка создает временную переменную temp и присваивает ей значение a.
a = b;: Эта строка присваивает значение b переменной a.
b = temp;: Эта строка присваивает значение temp переменной b.
for (size_t i = a; i < b; i++): Это цикл for, который начинается с a и заканчивается перед b.
if (i % 2 == 0): Это условное выражение проверяет, делится ли текущее значение i на 2 без остатка.
cout << i << endl;: Эта строка выводит значение i на экран и переходит на новую строку