/*
Задача 2.
Написать программу, которая 
    находит сумму чисел от 100 до 200 
    кратных 17.

Ответ: 867
*/

#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, ""); 
    int a = 100, b = 200, result = 0;
    for (size_t i = a; i < b; i++)
        if (i % 17 == 0)
        {
            result += i;
            cout << i << " | остаток от деления на 17: " << (i % 17) << endl;
        }
    cout << "result: " << result;
}

1 Устанавливает локаль для корректного отображения русских символов в консоли. Это делается с помощью функции setlocale, которая принимает два аргумента: LC_ALL и "". Первый аргумент указывает на то, что изменения должны применяться ко всем аспектам локали, а второй аргумент оставляет текущую локаль без изменений
2 Объявляет и инициализирует три целочисленные переменные a, b и result. Переменные a и b используются в качестве границ для цикла, а result используется для хранения суммы чисел, которые делятся на 17 без остатка.
3 Запускает цикл for, который итерирует по числам от a до b.
4 Внутри цикла проверяет, делится ли текущее число i на 17 без остатка. Если это условие выполняется, то число добавляется к result и выводится в консоль вместе с остатком от деления на 17.
4 После завершения цикла, выводится значение result, которое представляет собой сумму всех чисел от a до b, которые делятся на 17 без остатка.