/*
Задача 3.
Написать программу, которая 
    находит все четырёхзначные числа, 
    сумма цифр каждого из которых равна 15.

Этих цифр: 519
*/
// Включаем библиотеку ввода-вывода
#include <iostream>
// Используем пространство имен std для упрощения кода
using namespace std;

// Функция, которая вычисляет сумму цифр числа
int sumOfANumber(int number) {
    int result = 0; // Инициализируем переменную для хранения результата
    while (number) { // Пока число не равно нулю
        result += number % 10; // Добавляем последнюю цифру к результату
        number /= 10; // Удаляем последнюю цифру
    }
    return result; // Возвращаем результат
}

int main()
{
    setlocale(LC_ALL, ""); // Устанавливаем локаль для корректного отображения символов
    int a = 1000, b = 10000, amount = 0; // Инициализируем переменные для хранения границ диапазона чисел и счетчика найденных чисел
    for (; a < b; a++) // Проходим через все числа от a до b
        if (sumOfANumber(a) == 15) // Если сумма цифр числа равна 15
        {
            cout << a << endl; // Выводим число на экран
            amount++; // Увеличиваем счетчик найденных чисел
        }
    cout << "Количество чисел: " << amount; // Выводим общее количество найденных чисел
}