/*
Задача 4.
Напишите программу которая:
    - Получает на вход натуральное число.
    - Выводит наибольшую цифру данного натурального числа.
*/

#include <iostream> // Подключение библиотеки для ввода и вывода данных

// Функция для поиска наибольшей цифры в числе
int biggestDigitOfANumber(int number) {
    int maxDigit = INT_MIN; // Инициализация максимальной цифры наименьшим возможным значением
    while (number) { // Цикл, продолжающийся до тех пор, пока число не станет равным нулю
        if (maxDigit < number % 10) // Если текущее максимальное число меньше последней цифры числа
            maxDigit = number % 10; // Заменяем максимальное число на последнюю цифру числа
        number /= 10; // Удаляем последнюю цифру числа, деля на 10
    }
    return maxDigit; // Возвращаем максимальное число
}

int main() // Основная функция программы
{
    setlocale(LC_ALL, ""); // Установка локали для корректного отображения символов
    int num = 0; // Объявление и инициализация переменной num
    std::cin >> num; // Ввод числа пользователем
    std::cout << "Наибольшая цифра числа " << num << ": " << biggestDigitOfANumber(num); // Вывод наибольшей цифры числа
}